{
    "data": [
        {
            "number": 1,
            "title": "Pink Flamingos",
            "img": "https://upload.wikimedia.org/wikipedia/en/5/50/Pink_Flamingos_%281972%29.jpg",
            "year": "1972",
            "datePosted": "9/20",
            "director": "Directed by John Waters",
            "summary": "Notorious criminal underground legend Divine fights to maintain her title of Filthiest Person Alive.",
            "relatability": "the raunchy and surreal absurdity diminishes the relation greatly. The message of the movie is somewhat ironic and tongue-in-cheek. None of the characters are liekable but they are broadly relatable in the sense that we all have things that make us different that might be looked down on yet we should still feel pride and dignity.",
            "relatabilityScore": "2/10",
            "execution": "the lack of budget is apparent in the filmmaking but Waters did a good job of embracing that by using it to serve the aesthetic and subject matter. You can see a clear influence on later great low budget films like Gummo and Tangerine. The acting is bad but that adds to the quirky offbeat quality of the movie. The cinematography is appealingly trashy and some of the visuals are hauntingly disturbing in a disgusting manner.",
            "executionScore": "8/10",
            "context": "pretty funny little story regarding a fight for superiority. Like a disgusting Hatfields and McCoys. The plot is merely a framework to hang weird and gross shit on and it accomplished that.",
            "contextScore": "8/10",
            "subtext": "kind of interesting movie. I know in the trans community an egg refers to someone who hasn't realized they're trans yet but it can also more broadly mean someone who hasn't come out of their shell. The grandmother loves eggs and eats them in a gluttonous manner in her crib. So she's a fat baby who married an egg man. Seems like there might be something there, probably just to say Divine's family wasn't supportive, which seems apparent through her actions. Otherwise Divine's ideology seems like an embracement of the criticisms society might have for her more natural inclinations. Like society calls her disgusting so she gets back at it by showing them how disgusting it can get. Divine killing the other filthy people and the police seemed like a statement on her individuality and agency.",
            "subtextScore": "7/10",
            "emotion": "if you have a weak stomach for gross or sexual content I would highly recommend not watching this film. If you're into watching the weirdest most fucked up shit you can find this is a must watch. Very disturbing and grotesque content that had a shocking and haunting effect. The range of emotions is limited to comedy and nastiness but delivers heavily in those categories.",
            "emotionScore": "6.5/10",
            "overAllRating": "58",
            "song": "Freak Like Me - Halestorm"

        }
    ]
}